app/views/comments/_comment.html.erb

INSERT INTO "comments" ("user_id", "body", "rating", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["body", "TEST AJAX AND PARTIAL"], ["rating", 5], ["product_id", 1], ["created_at", "2017-08-12 15:22:01.570937"], ["updated_at", "2017-08-12 15:22:01.570937"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <p>
    <%= comment.user.first_name %> <small><em><%= "#{time_ago_in_words(comment.created_at)} ago" %></em></small>