app/controllers/comments_controller.rb

    def create
      @product = Product.find(params[:product_id])
      @comment = @product.comments.new(comment_params)
      @comment.user = current_user
      respond_to do |format|
        if @comment.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "body", "rating", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["body", "Crappy"], ["rating", 1], ["product_id", 1], ["created_at", "2017-08-01 19:31:04.020337"], ["updated_at", "2017-08-01 19:31:04.020337"]]

  def destroy
    @comment = Comment.find(params[:id])
    product = @comment.product
    @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]