app/controllers/payments_controller.rb

  def create
    token = params[:stripeToken]
    @product = Product.find(params[:product_id]) # Refer to hidden field in show form
    @user = current_user # Devise helper
    # Create a payment token to Stripe's servers - this will charge the user's card
    begin
      charge = Stripe::Charge.create(
        amount: (@product.price * 100).to_i, #amount in cents
        currency: "zar",
        source: token,
        description: params[:stripeEmail]
      )
      if charge.paid
        Order.create(product_id: @product.id, user_id: @user.id, total: @product.price)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "product_id", "total") VALUES (?, ?, ?)  [["user_id", 1], ["product_id", 1], ["total", 260.0]]