app/controllers/products_controller.rb

  def index
    if params[:q]
      search_term = params[:q]
      @products = Product.search(search_term)
---
SELECT "products".* FROM "products" WHERE (name LIKE '%#{search_term}%')
SELECT MAX("products"."updated_at") FROM "products"

  def show
    @comments = @product.comments.paginate(page: params[:page])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."product_id" = ? LIMIT ? OFFSET ?  [["product_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 1]]

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at", "colour") VALUES (?, ?, ?, ?, ?, ?)  [["name", "this is a name"], ["description", ""], ["image_url", ""], ["created_at", "2017-08-17 18:07:19.945172"], ["updated_at", "2017-08-17 18:07:19.945172"], ["colour", ""]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "name" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "WarmKeeper"], ["updated_at", "2017-08-18 16:46:39.851742"], ["id", 1]]