app/controllers/products_controller.rb

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "name" = ?, "price" = ?, "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Filthy Shirt"], ["price", 400], ["description", "Shirt full of tomato sauce"], ["updated_at", "2017-08-18 16:03:18.220054"], ["id", 1]]