app/controllers/static_pages_controller.rb

  def landing_page
    @products = Product.limit(3)
---
SELECT  "products".* FROM "products" LIMIT ?  [["LIMIT", 3]]